package unnamedtasks

/* Условие задачи:
Даны переменные A, B, C. Изменить их значения, переместив содержимое
A в C,
C в B,
B в A,
и вывести новые значения переменных A, B, C.
*/

fun main() {
    var A = 31
    var B = 566
    var C = 12

    println("A = $A, B = $B, C = $C")

    A = A + B + C // 31  + 566 + 12 = 609
    B = A - B - C // 609 - 566 - 12 = 31
    A = A - B - C // 609 - 31 - 12          : B в A
    B = B + C // 31 + 12 = 43
    C = B - C // 43 - 12 = 31               : A в C
    B = B - C // 43 - 31 = 12               : C в B

    println("A = $A, B = $B, C = $C")

}
